#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

OpenTofu
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Reading...
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Read complete after 0s
module.networks["dev_au"].konnect_cloud_gateway_network.cgw_network: Refreshing state... [id=4c0d6de4-0f21-4de9-8071-d92f4eee1887]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.control-planes.konnect_gateway_control_plane.cps["dev_au_cloud"] will be created
  + resource "konnect_gateway_control_plane" "cps" {
      + auth_type     = "pinned_client_certs"
      + cloud_gateway = true
      + cluster_type  = "CLUSTER_TYPE_CONTROL_PLANE"
      + config        = (known after apply)
      + description   = "Control plane in AU used by cloud devops team"
      + id            = (known after apply)
      + labels        = {
          + "environment" = "cloud"
          + "provisioner" = "terraform"
          + "region"      = "au"
          + "team"        = "devops"
        }
      + name          = "dev-au-cloud"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alex"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "alex"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alice"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "alice"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["anna"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "anna"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["bob"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "bob"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["gary"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "gary"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["joe"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "joe"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["robin"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "robin"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["tom"] will be created
  + resource "konnect_gateway_consumer" "users" {
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + custom_id        = (known after apply)
      + id               = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
      + username         = "tom"
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alex"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alice"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["anna"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["bob"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["gary"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["joe"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["robin"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["tom"] will be created
  + resource "konnect_gateway_key_auth" "user_apikeys" {
      + consumer         = (known after apply)
      + consumer_id      = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + tags             = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_plugin_key_auth.key_auth will be created
  + resource "konnect_gateway_plugin_key_auth" "key_auth" {
      + config           = {
          + anonymous        = (known after apply)
          + hide_credentials = false
          + key_in_body      = (known after apply)
          + key_in_header    = (known after apply)
          + key_in_query     = (known after apply)
          + key_names        = (known after apply)
          + realm            = (known after apply)
          + run_on_preflight = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = (known after apply)
      + service          = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_plugin_request_termination.catch_all_terminate will be created
  + resource "konnect_gateway_plugin_request_termination" "catch_all_terminate" {
      + config           = {
          + body         = (known after apply)
          + content_type = (known after apply)
          + echo         = (known after apply)
          + message      = "🚧😮\u200d💨"
          + status_code  = 503
          + trigger      = (known after apply)
        }
      + consumer         = (known after apply)
      + consumer_group   = (known after apply)
      + control_plane_id = (known after apply)
      + created_at       = (known after apply)
      + enabled          = true
      + id               = (known after apply)
      + instance_name    = (known after apply)
      + protocols        = (known after apply)
      + route            = {
          + id = (known after apply)
        }
      + service          = (known after apply)
      + tags             = (known after apply)
      + updated_at       = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_route.catch_all will be created
  + resource "konnect_gateway_route" "catch_all" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = (known after apply)
      + name                       = "catch-all-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = (known after apply)
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_route.echo will be created
  + resource "konnect_gateway_route" "echo" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = [
          + "GET",
        ]
      + name                       = "echo-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/echo",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = {
          + id = (known after apply)
        }
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = false
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_route.httpbin will be created
  + resource "konnect_gateway_route" "httpbin" {
      + control_plane_id           = (known after apply)
      + created_at                 = (known after apply)
      + destinations               = (known after apply)
      + headers                    = (known after apply)
      + hosts                      = (known after apply)
      + https_redirect_status_code = (known after apply)
      + id                         = (known after apply)
      + methods                    = [
          + "GET",
        ]
      + name                       = "httpbin-route"
      + path_handling              = (known after apply)
      + paths                      = [
          + "/bin",
        ]
      + preserve_host              = (known after apply)
      + protocols                  = (known after apply)
      + regex_priority             = (known after apply)
      + request_buffering          = (known after apply)
      + response_buffering         = (known after apply)
      + service                    = {
          + id = (known after apply)
        }
      + snis                       = (known after apply)
      + sources                    = (known after apply)
      + strip_path                 = true
      + tags                       = (known after apply)
      + updated_at                 = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_service.echo will be created
  + resource "konnect_gateway_service" "echo" {
      + ca_certificates    = (known after apply)
      + client_certificate = (known after apply)
      + connect_timeout    = (known after apply)
      + control_plane_id   = (known after apply)
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + host               = "ip-168-186-31-166.ap-southeast-2.compute.internal"
      + id                 = (known after apply)
      + name               = "echo-svc"
      + path               = "/"
      + port               = 8080
      + protocol           = "http"
      + read_timeout       = (known after apply)
      + retries            = (known after apply)
      + tags               = (known after apply)
      + tls_verify         = (known after apply)
      + tls_verify_depth   = (known after apply)
      + updated_at         = (known after apply)
      + write_timeout      = (known after apply)
    }

  # module.kong-configs-dev-au-cloud.konnect_gateway_service.httpbin will be created
  + resource "konnect_gateway_service" "httpbin" {
      + ca_certificates    = (known after apply)
      + client_certificate = (known after apply)
      + connect_timeout    = (known after apply)
      + control_plane_id   = (known after apply)
      + created_at         = (known after apply)
      + enabled            = (known after apply)
      + host               = "httpbin.org"
      + id                 = (known after apply)
      + name               = "httpbin-svc"
      + path               = "/"
      + port               = 443
      + protocol           = "https"
      + read_timeout       = (known after apply)
      + retries            = (known after apply)
      + tags               = (known after apply)
      + tls_verify         = (known after apply)
      + tls_verify_depth   = (known after apply)
      + updated_at         = (known after apply)
      + write_timeout      = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*